---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainDoesNotEngageUorV
source: html/28ed6d25-bbae-9632-1563-403406769720.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainDoesNotEngageUorV Property

A chain formed by these curve elements does engage any gridlines on the face to be divided and will be ignored

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceCurveChainDoesNotEngageUorV { get; }
```